app/views/comments/index.html.erb

SELECT "comments".* FROM "comments"
---
<div class="text-center">
  <% if @current_user.comments.count > 0 %>