app/views/users/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."user_id" = $1  [["user_id", 1]]
---

<% @user.images.each do |i| %>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---

<% @user.comments.each do |c| %>