app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Hello moto"], ["user_id", 1], ["created_at", "2016-06-06 22:51:17.770726"], ["updated_at", "2016-06-06 22:51:17.770726"]]
---
  def create
    @comment = Comment.new(comments_params)
    @comment.user = current_user
    if @comment.save

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "fd;kjsadfk;lj"], ["updated_at", "2016-06-07 23:00:32.764679"], ["id", 5]]
---
  def update
    if @comment.update(comments_params)