app/controllers/images_controller.rb

SELECT "images".* FROM "images"  ORDER BY created_at DESC
---
  def index
    @images = Image.all.order("created_at DESC")

INSERT INTO "images" ("title", "img_file_name", "img_content_type", "img_file_size", "img_updated_at", "description", "tags", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @image = Image.new(images_params)
    @image.user = current_user
    if @image.save

UPDATE "images" SET "img_file_name" = $1, "img_file_size" = $2, "img_updated_at" = $3, "updated_at" = $4 WHERE "images"."id" = $5  [["img_file_name", "ninja.png"], ["img_file_size", 19982], ["img_updated_at", "2016-06-08 01:31:20.170288"], ["updated_at", "2016-06-08 01:31:20.266915"], ["id", 5]]
---
  def update
    if @image.update_attributes(images_params)

SELECT "images".* FROM "images"
SELECT COUNT(*) FROM "images"
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", nil]]
---
  def set_image
    if Image.count > 0
    @image = Image.find(params[:id])