app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "Photo_on_6-7-16_at_12.21_PM.jpg"], ["avatar_file_size", 154588], ["avatar_updated_at", "2016-06-07 19:22:03.612131"], ["updated_at", "2016-06-07 19:22:03.916830"], ["id", 5]]
---
  def update
    if @user.update(user_params)