app/views/images/index.html.erb

SELECT "images".* FROM "images"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "images"
---
<% if Image.count > 0 %>