app/views/images/show.html.erb

<% if Image.count > 0 %>
---
SELECT COUNT(*) FROM "images"